## Plan for org_account/main
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 17 to add, 1 to change, 8 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudtrail_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "xray:GetSamplingRules",
              + "xray:GetSamplingStatisticSummaries",
              + "xray:GetSamplingTargets",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.cloudtrail_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda will be created
  + resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/sentinel-cloud-trail-forwarder"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + tags_all          = {
          + "CostCentre" = "cds-aws-lz-production"
        }
    }

  # module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0] will be created
  + resource "aws_iam_policy" "sentinel_forwarder_lambda_s3" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SentinelForwarderLambdaS3-sentinel-cloud-trail-forwarder"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::aws-aft-logs-{data.aws_caller_identity.log_archive.account_id}-ca-central-1"
                      + Sid      = "1"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::aws-aft-logs-{data.aws_caller_identity.log_archive.account_id}-ca-central-1/*"
                      + Sid      = "2"
                    },
                  + {
                      + Action   = "kms:decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:ca-central-1:274536870005:key/72713e0c-b7f4-438a-9eca-41c36b775f30"
                      + Sid      = "3"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.cloudtrail_forwarder.aws_iam_role.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role" "sentinel_forwarder_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.cloudtrail_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder"
    }

  # module.cloudtrail_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda_s3[0] will be created
  + resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SentinelForwarderLambda-sentinel-cloud-trail-forwarder"
    }

  # module.cloudtrail_forwarder.aws_lambda_function.sentinel_forwarder will be created
  + resource "aws_lambda_function" "sentinel_forwarder" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to forward AWS logs to Azure Sentinel"
      + filename                       = "/tmp/sentinel_forwarder.py.zip"
      + function_name                  = "sentinel-cloud-trail-forwarder"
      + handler                        = "sentinel_forwarder.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:6",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "liR4yJNhp6SJtCjkSwnH0xGC0q00Uxebs1Cyqv8JLDw="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + tags_all                       = {
          + "CostCentre" = "cds-aws-lz-production"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "CUSTOMER_ID" = (sensitive)
              + "LOG_TYPE"    = "ApplicationLog"
              + "SHARED_KEY"  = (sensitive)
            }
        }

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.cloudtrail_forwarder.aws_lambda_permission.sentinel_forwarder_s3_triggers[0] will be created
  + resource "aws_lambda_permission" "sentinel_forwarder_s3_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "sentinel-cloud-trail-forwarder"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_account      = "274536870005"
      + source_arn          = "arn:aws:s3:::aws-aft-logs-{data.aws_caller_identity.log_archive.account_id}-ca-central-1"
      + statement_id        = "AllowExecutionFromS3-sentinel-cloud-trail-forwarder-0"
      + statement_id_prefix = (known after apply)
    }

  # module.cloudtrail_forwarder.aws_s3_bucket_notification.sentinel_forwarder_trigger_notification[0] will be created
  + resource "aws_s3_bucket_notification" "sentinel_forwarder_trigger_notification" {
      + bucket      = "aws-aft-logs-{data.aws_caller_identity.log_archive.account_id}-ca-central-1"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "AWSLogs/o-625no8z3dd/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.guardduty_forwarder.data.aws_iam_policy_document.sentinel_forwarder_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "sentinel_forwarder_lambda"  {
      ~ id      = "2032253958" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/senting-guard-duty-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/senting-guard-duty-forwarder:*",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.guardduty_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_cloudwatch_log_group" "sentinel_forwarder_lambda" {
      ~ arn               = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/senting-guard-duty-forwarder" -> (known after apply)
      ~ id                = "/aws/lambda/senting-guard-duty-forwarder" -> (known after apply)
      ~ name              = "/aws/lambda/senting-guard-duty-forwarder" -> "/aws/lambda/sentinal-guard-duty-forwarder" # forces replacement
        tags              = {
            "CostCentre" = "cds-aws-lz-production"
        }
        # (2 unchanged attributes hidden)
    }

  # module.guardduty_forwarder.aws_iam_policy.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_policy" "sentinel_forwarder_lambda" {
      ~ arn       = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-senting-guard-duty-forwarder" -> (known after apply)
      ~ id        = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-senting-guard-duty-forwarder" -> (known after apply)
      ~ name      = "SentinelForwarderLambda-senting-guard-duty-forwarder" -> "SentinelForwarderLambda-sentinal-guard-duty-forwarder" # forces replacement
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:274536870005:log-group:/aws/lambda/senting-guard-duty-forwarder:*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id = "ANPAT725MGB2243HHN2HN" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.guardduty_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0] must be replaced
-/+ resource "aws_iam_policy" "sentinel_forwarder_lambda_s3" {
      ~ arn       = "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-senting-guard-duty-forwarder" -> (known after apply)
      ~ id        = "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-senting-guard-duty-forwarder" -> (known after apply)
      ~ name      = "SentinelForwarderLambdaS3-senting-guard-duty-forwarder" -> "SentinelForwarderLambdaS3-sentinal-guard-duty-forwarder" # forces replacement
      ~ policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action   = "s3:ListBucket"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::terraform-20220502135712124000000002"
                        Sid      = "1"
                    },
                    {
                        Action   = "s3:GetObject"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::terraform-20220502135712124000000002/*"
                        Sid      = "2"
                    },
                    {
                        Action   = "kms:decrypt"
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:ca-central-1:274536870005:key/ac28fa03-4767-441a-b77b-b73d090618ef"
                        Sid      = "3"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ policy_id = "ANPAT725MGB264JH4UD7I" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.guardduty_forwarder.aws_iam_role.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_role" "sentinel_forwarder_lambda" {
      ~ arn                   = "arn:aws:iam::274536870005:role/SentinelForwarderLambda-senting-guard-duty-forwarder" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-06-08T19:08:37Z" -> (known after apply)
      ~ id                    = "SentinelForwarderLambda-senting-guard-duty-forwarder" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-senting-guard-duty-forwarder",
          - "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-senting-guard-duty-forwarder",
        ] -> (known after apply)
      ~ name                  = "SentinelForwarderLambda-senting-guard-duty-forwarder" -> "SentinelForwarderLambda-sentinal-guard-duty-forwarder" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAT725MGB23DCKWAL2Y" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.guardduty_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda must be replaced
-/+ resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda" {
      ~ id         = "SentinelForwarderLambda-senting-guard-duty-forwarder-20220608190838743400000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::274536870005:policy/SentinelForwarderLambda-senting-guard-duty-forwarder" -> (known after apply) # forces replacement
      ~ role       = "SentinelForwarderLambda-senting-guard-duty-forwarder" -> "SentinelForwarderLambda-sentinal-guard-duty-forwarder" # forces replacement
    }

  # module.guardduty_forwarder.aws_iam_role_policy_attachment.sentinel_forwarder_lambda_s3[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "sentinel_forwarder_lambda_s3" {
      ~ id         = "SentinelForwarderLambda-senting-guard-duty-forwarder-20220608190838748000000002" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::274536870005:policy/SentinelForwarderLambdaS3-senting-guard-duty-forwarder" -> (known after apply) # forces replacement
      ~ role       = "SentinelForwarderLambda-senting-guard-duty-forwarder" -> "SentinelForwarderLambda-sentinal-guard-duty-forwarder" # forces replacement
    }

  # module.guardduty_forwarder.aws_lambda_function.sentinel_forwarder must be replaced
-/+ resource "aws_lambda_function" "sentinel_forwarder" {
      ~ architectures                  = [] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:274536870005:function:senting-guard-duty-forwarder" -> (known after apply)
      - code_signing_config_arn        = "" -> null
      ~ function_name                  = "senting-guard-duty-forwarder" -> "sentinal-guard-duty-forwarder" # forces replacement
      ~ id                             = "senting-guard-duty-forwarder" -> (known after apply)
      - image_uri                      = "" -> null
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:274536870005:function:senting-guard-duty-forwarder/invocations" -> (known after apply)
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2022-06-14T15:00:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:274536870005:function:senting-guard-duty-forwarder:$LATEST" -> (known after apply)
      ~ role                           = "arn:aws:iam::274536870005:role/SentinelForwarderLambda-senting-guard-duty-forwarder" -> (known after apply)
      ~ signing_job_arn                = "" -> (known after apply)
      ~ signing_profile_version_arn    = "" -> (known after apply)
      ~ source_code_size               = 300 -> (known after apply)
        tags                           = {
            "CostCentre" = "cds-aws-lz-production"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)


      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.guardduty_forwarder.aws_lambda_permission.sentinel_forwarder_s3_triggers[0] must be replaced
-/+ resource "aws_lambda_permission" "sentinel_forwarder_s3_triggers" {
      ~ function_name       = "senting-guard-duty-forwarder" -> "sentinal-guard-duty-forwarder" # forces replacement
      ~ id                  = "AllowExecutionFromS3-senting-guard-duty-forwarder-0" -> (known after apply)
      ~ statement_id        = "AllowExecutionFromS3-senting-guard-duty-forwarder-0" -> "AllowExecutionFromS3-sentinal-guard-duty-forwarder-0" # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.guardduty_forwarder.aws_s3_bucket_notification.sentinel_forwarder_trigger_notification[0] will be updated in-place
  ~ resource "aws_s3_bucket_notification" "sentinel_forwarder_trigger_notification" {
        id          = "terraform-20220502135712124000000002"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
            id                  = "tf-s3-lambda-20220608190855506800000003"
          ~ lambda_function_arn = "arn:aws:lambda:ca-central-1:274536870005:function:senting-guard-duty-forwarder" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 17 to add, 1 to change, 8 to destroy.

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 16 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.warning"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_failure[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops1\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.alarm_actions.aws_cloudwatch_metric_alarm.alarm_success[\"Ops2\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_iam_policy.sentinel_forwarder_lambda_s3[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.cloudtrail_forwarder.aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_east_1"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_aft_management_detector.aws_guardduty_detector.us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["module.gd_audit_detector.aws_guardduty_detector.ca_central_1"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
